#ifndef _24c02_H
#define _24c02_H

#include "public.h"

/********************************************************************
***********
* 函数名: at24c02_write_one_byte
* 函数功能: 在AT24CXX 指定地址写入一个数据
286
* 输入: addr:写入数据的目的地址
dat:要写入的数据
* 输出: 无
*********************************************************************
**********/
void at24c02_write_one_byte(u8 addr, u8 dat);

/********************************************************************
***********
* 函数名: at24c02_read_one_byte
* 函数功能: 在AT24CXX 指定地址读出一个数据
* 输入: addr:开始读数的地址
* 输出: 读到的数据
*********************************************************************
**********/
u8 at24c02_read_one_byte(u8 addr);

#endif
